Revit 2027 API
ParameterTypeId.RbsElecCircuitPathModeParam Property
 "Path Mode"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RbsElecCircuitPathModeParam { get; }
Public Shared ReadOnly Property RbsElecCircuitPathModeParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RbsElecCircuitPathModeParam {
	ForgeTypeId^ get ();
}
static member RbsElecCircuitPathModeParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace